Revit 2027 API
RebarCurvesData.SetDistributionPath Method
 Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistributionPath(
	IList<Curve> path
)
Public Sub SetDistributionPath (
	path As IList(Of Curve)
)
public:
void SetDistributionPath(
	IList<Curve^>^ path
)
member SetDistributionPath :
        path : IList<Curve> -> unit
Parameters
path IList<Curve>
 Input curves that describe the new path.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace